// window.addEventListener("DOMContentLoaded", () => {

// })

const num01 = 1;
const Num01 = 2;
// 변수명 선언시, 유의사항
// 변수명으로는 예약어 사용 불가!
// document, window => 이미 js에서 찜해놓고 잘 쓰는 예약어임 (const 쓰지마!)
// 변수명의 첫 단어로는 $, _, 영문자만 가능! (숫자 절대 불가능, 오류 남)
// 단, 변수명 중간 혹은 끝에는 숫자 가능 (처음에만 안됨!)
// 변수명은 반드시 대,소문자를 가림 (아예 다름)

// 3가지 방식
// 1) 카멜표기법 : 낙타 / 서로 다른 2개의 변수를 만들 때 가운데 혹을 만드는 것
const numberSum = 3;

// 2) 스네이크표기법 : 뱀 / 가운데를 파는 것
const number_sum = 4;
const $number_sum = 5;

// 3) 헝가리안표기법 : 첫번째 단어를 무조건 대문자로 쓰느 것 (인종차별로 잘 안 씀)
// (클래스 선언 후 객체 / 변수를 구분시켜 주기 위해)
const Number = 6;
